<?php 
//Задание 1
echo "<h2>Задание 1</h2>";
//-------------------------------------------------------------------------------

$i = 0;
$n = 100;

while ($i <= $n){
  if ($i % 3 == 0)
    echo "$i<br/>";
  $i++;
}
//Задание 2
echo "<h2>Задание 2</h2>";
//-------------------------------------------------------------------------------

$a = 0;
$b = 10;

do {
  if ($a == 0){
    echo "$a - ноль <br>";
  }elseif ($a % 2 == 0) {
    echo "$a - четное число <br>";
  }else {
    echo "$a - нечетное число <br>";
  }
  $a++;
  
} while ($a<= 10);

//Задание 3
echo "<h2>Задание 3</h2>";
//-------------------------------------------------------------------------------

$regions = [
  "Московская область" =>["Москва", "Зеленоград", "Клин"], 
  "Ленинградская область" =>["Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"], 
  "Рязанская область" =>["Рязань", "Касимов", "Шилово"]
];

foreach ($regions as $key => $city_region) {
  echo "<p><b>$key: </b><br></p>";
  foreach ($city_region as $key2 => $name) {
    echo "$name <br>" ;
  }
}

//Задание 4
echo "<h2>Задание 4</h2>";
//-------------------------------------------------------------------------------

$s = "Привет, просто нашёл эту функцию в Гугле";

function translit($s) { 
  $s = strtr($s, ['а'=>'a','б'=>'b','в'=>'v','г'=>'g','д'=>'d','е'=>'e','ё'=>'e','ж'=>'j','з'=>'z','и'=>'i','й'=>'y','к'=>'k','л'=>'l','м'=>'m','н'=>'n','о'=>'o','п'=>'p','р'=>'r','с'=>'s','т'=>'t','у'=>'u','ф'=>'f','х'=>'h','ц'=>'c','ч'=>'ch','ш'=>'sh','щ'=>'shch','ы'=>'y','э'=>'e','ю'=>'yu','я'=>'ya','ъ'=>'','ь'=>'','А'=>'a','Б'=>'b','В'=>'v','Г'=>'g','Д'=>'d','Е'=>'e','Ё'=>'e','Ж'=>'j','З'=>'z','И'=>'i','Й'=>'y','К'=>'k','Л'=>'l','М'=>'m','Н'=>'n','О'=>'o','П'=>'p','Р'=>'r','С'=>'s','Т'=>'t','У'=>'u','Ф'=>'f','Х'=>'h','Ц'=>'c','Ч'=>'ch','Ш'=>'sh','Щ'=>'shch','Ы'=>'y','Э'=>'e','Ю'=>'yu','Я'=>'ya','Ъ'=>'','Ь'=>'']);
  return $s; // возвращаем результат strstr --  Находит первое вхождение подстроки
}

echo translit($s);

//Задание 5
echo "<h2>Задание 5</h2>";
//-------------------------------------------------------------------------------
$z = "Привет, просто нашёл эту функцию в Гугле";

function replace($z) {
$z = str_replace(" ", "_", $z); // заменяем пробелы знаком минус
return $z;
}

echo replace($z);

//Задание 6
echo "<h2>Задание 6</h2>";
//-------------------------------------------------------------------------------

$menu = ["Главная", "Услуги" => ["Разработка веб-сайтов", "СЕО-оптимизация", "Контекстная реклама"], "О компании" => ["Наша миссия", "История", "Портфолио"], "Контакты"];

echo "<ul>";
foreach ($menu as $count => $itemname) {
  if (gettype($itemname) == "array" ) {
    echo "<li>".$count."<ul>";
    foreach ($itemname as $itemname2) {
      echo "<li>".$itemname2."</li>";
    }
    echo "</ul>";
  }
  else echo "<li>".$itemname."</li>";
}
echo "</ul>";

//Задание 7
echo "<h2>Задание 7</h2>";
//-------------------------------------------------------------------------------

for ($i=0; $i <=9; print "$i<br>", $i++) { 
  # code...
}

//Задание 8
echo "<h2>Задание 8</h2>";
//-------------------------------------------------------------------------------


foreach ($regions as $key => $city_region) {
  echo "<p><b>$key: </b><br></p>";
  foreach ($city_region as $key2 => $name) {
    $name = (string) $name;
    if (mb_substr($name, 0, 1) == "К") {
      echo "$name <br>" ;
    }
  }
}

//Задание 9
echo "<h2>Задание 9</h2>";
//-------------------------------------------------------------------------------
$b = "Какая-то строка на русском языке";

function merge($b) {
 $c = translit($b);
 $n = replace($c);
  echo "$n";
}

echo merge("$b");
?>